; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l14-t1-p4---int100n150-m25---int100c110---s276---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level0 level22 level22)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level1 level22 level23)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level2 level22 level24)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level3 level22 level25)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level4 level22 level26)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level5 level22 level27)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level6 level22 level28)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level7 level22 level29)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level8 level22 level30)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level9 level22 level31)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level10 level22 level32)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level11 level22 level33)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level12 level22 level34)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level13 level22 level35)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level14 level22 level36)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level15 level22 level37)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level16 level22 level38)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level17 level22 level39)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level18 level22 level40)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level19 level22 level41)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level20 level22 level42)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level21 level22 level43)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level22 level22 level44)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level23 level22 level45)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level24 level22 level46)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level25 level22 level47)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level26 level22 level48)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level27 level22 level49)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level28 level22 level50)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level29 level22 level51)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level30 level22 level52)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level31 level22 level53)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level32 level22 level54)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level33 level22 level55)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level34 level22 level56)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level35 level22 level57)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level36 level22 level58)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level8 level51)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level8 level52)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level8 level53)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level8 level54)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level8 level55)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level8 level56)
(sum level48 level10 level58)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level8 level57)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level8 level58)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level57 level1 level58)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l5)
(fuelcost level22 l0 l5)
(connected l0 l8)
(fuelcost level4 l0 l8)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l1 l10)
(fuelcost level17 l1 l10)
(connected l1 l12)
(fuelcost level2 l1 l12)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l2 l7)
(fuelcost level14 l2 l7)
(connected l2 l10)
(fuelcost level25 l2 l10)
(connected l3 l4)
(fuelcost level11 l3 l4)
(connected l3 l13)
(fuelcost level11 l3 l13)
(connected l4 l3)
(fuelcost level11 l4 l3)
(connected l4 l6)
(fuelcost level25 l4 l6)
(connected l4 l8)
(fuelcost level16 l4 l8)
(connected l4 l10)
(fuelcost level13 l4 l10)
(connected l5 l0)
(fuelcost level22 l5 l0)
(connected l5 l8)
(fuelcost level11 l5 l8)
(connected l6 l4)
(fuelcost level25 l6 l4)
(connected l6 l12)
(fuelcost level1 l6 l12)
(connected l6 l13)
(fuelcost level11 l6 l13)
(connected l7 l2)
(fuelcost level14 l7 l2)
(connected l7 l9)
(fuelcost level2 l7 l9)
(connected l7 l10)
(fuelcost level24 l7 l10)
(connected l7 l11)
(fuelcost level8 l7 l11)
(connected l8 l0)
(fuelcost level4 l8 l0)
(connected l8 l4)
(fuelcost level16 l8 l4)
(connected l8 l5)
(fuelcost level11 l8 l5)
(connected l8 l9)
(fuelcost level23 l8 l9)
(connected l9 l7)
(fuelcost level2 l9 l7)
(connected l9 l8)
(fuelcost level23 l9 l8)
(connected l9 l13)
(fuelcost level10 l9 l13)
(connected l10 l1)
(fuelcost level17 l10 l1)
(connected l10 l2)
(fuelcost level25 l10 l2)
(connected l10 l4)
(fuelcost level13 l10 l4)
(connected l10 l7)
(fuelcost level24 l10 l7)
(connected l11 l7)
(fuelcost level8 l11 l7)
(connected l12 l1)
(fuelcost level2 l12 l1)
(connected l12 l6)
(fuelcost level1 l12 l6)
(connected l13 l3)
(fuelcost level11 l13 l3)
(connected l13 l6)
(fuelcost level11 l13 l6)
(connected l13 l9)
(fuelcost level10 l13 l9)

(at t0 l0)
(fuel t0 level58)
(= (total-cost) 0)

(at p0 l8)
(at p1 l8)
(at p2 l13)
(at p3 l0)
)

(:goal
(and
(at p0 l13)
(at p1 l12)
(at p2 l12)
(at p3 l7)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 4
2. (drive t0 l0 l8 level54 level4 level58)
   deleted: (at t0 l0) (fuel t0 level58)
   added: (at t0 l8) (fuel t0 level54)
   goals met: 0 of 4
3. (load p1 t0 l8)
   deleted: (at p1 l8)
   added: (in p1 t0)
   goals met: 0 of 4
4. (load p0 t0 l8)
   deleted: (at p0 l8)
   added: (in p0 t0)
   goals met: 0 of 4
5. (drive t0 l8 l9 level31 level23 level54)
   deleted: (at t0 l8) (fuel t0 level54)
   added: (at t0 l9) (fuel t0 level31)
   goals met: 0 of 4
6. (drive t0 l9 l7 level29 level2 level31)
   deleted: (at t0 l9) (fuel t0 level31)
   added: (at t0 l7) (fuel t0 level29)
   goals met: 0 of 4
7. (unload p3 t0 l7)
   deleted: (in p3 t0)
   added: (at p3 l7)
   goals met: 1 of 4
8. (drive t0 l7 l9 level27 level2 level29)
   deleted: (at t0 l7) (fuel t0 level29)
   added: (at t0 l9) (fuel t0 level27)
   goals met: 1 of 4
9. (drive t0 l9 l13 level17 level10 level27)
   deleted: (at t0 l9) (fuel t0 level27)
   added: (at t0 l13) (fuel t0 level17)
   goals met: 1 of 4
10. (load p2 t0 l13)
   deleted: (at p2 l13)
   added: (in p2 t0)
   goals met: 1 of 4
11. (unload p0 t0 l13)
   deleted: (in p0 t0)
   added: (at p0 l13)
   goals met: 2 of 4
12. (drive t0 l13 l6 level6 level11 level17)
   deleted: (at t0 l13) (fuel t0 level17)
   added: (at t0 l6) (fuel t0 level6)
   goals met: 2 of 4
13. (drive t0 l6 l12 level5 level1 level6)
   deleted: (at t0 l6) (fuel t0 level6)
   added: (at t0 l12) (fuel t0 level5)
   goals met: 2 of 4
14. (unload p1 t0 l12)
   deleted: (in p1 t0)
   added: (at p1 l12)
   goals met: 3 of 4
15. (unload p2 t0 l12)
   deleted: (in p2 t0)
   added: (at p2 l12)
   goals met: 4 of 4
